# Removendo linhas duplicadas no Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
#read a dataset of movie reviwers into DF
colunas = ["user_id","age","gender","occupation","zip_code"]
usuarios = pd.read_table("C:\\Users\\grati\\Downloads\\duplicadas.txt", sep ="|", header = 0, names = colunas)
usuarios.head(10)

   user_id  age gender  occupation  zip_code
0        2   53      F       other     94043
1        3   23      M      writer     32067
2        1   24      M  technician     85711
3        4   24      M  technician     43537
4        5   33      F       other     15213
5        5   33      F       other     15213
6        1   24      M  technician     85711

In [3]:
# verificando linhas e colunas
usuarios.shape

(7, 5)

In [6]:
# Procurando por CEPs duplicadas
usuarios.zip_code.duplicated().head(20)

0    False
1    False
2    False
3    False
4    False
5     True
6     True
Name: zip_code, dtype: bool

In [7]:
# Como aprendemos, uma série boleana pode se convertida em 0 e 1 automaticamente ao utilizarmos métodos de agregação
usuarios.zip_code.duplicated().sum()

2

In [8]:
# Verificando se uma LINHA INTEIRA é duplicada

usuarios.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [9]:
# Contando as linhas duplicadas
usuarios.duplicated().sum()

2

In [10]:
# Mantendo a primeira linha 
usuarios.loc[usuarios.duplicated(keep="first"), :]

   user_id  age gender  occupation  zip_code
5        5   33      F       other     15213
6        1   24      M  technician     85711

In [11]:
# Mantendo a última linha
usuarios.loc[usuarios.duplicated(keep="last"), :]

   user_id  age gender  occupation  zip_code
2        1   24      M  technician     85711
4        5   33      F       other     15213

In [12]:
# todas as linhas duplicadas
usuarios.loc[usuarios.duplicated(keep=False), :]

   user_id  age gender  occupation  zip_code
2        1   24      M  technician     85711
4        5   33      F       other     15213
5        5   33      F       other     15213
6        1   24      M  technician     85711

In [13]:
# Apagando as linhas duplicadas (inplace = False por default) - shape do dataset que FICOU

usuarios.drop_duplicates(keep="first").shape

(5, 5)

In [14]:
usuarios.drop_duplicates(keep="last").shape

(5, 5)

In [15]:
usuarios.drop_duplicates(keep=0).shape

(3, 5)

# Apagando as linhas duplicadas com drop_duplicate()

In [16]:
# Apagando as linhas duplicadas (inplace = False por default)
usuarios.drop_duplicates(keep="first").shape

(5, 5)

In [17]:
usuarios.drop_duplicates(keep="last").shape

(5, 5)

In [19]:
usuarios.drop_duplicates(keep=False).shape

(3, 5)